1. a) Import pandas under the name pd.

b) Print the version of pandas that has been imported.

c) Print out all the version information of the libraries that are required by the pandas library.

In [1]:
import pandas as pd 
import numpy as np

In [3]:
print(pd.__version__)
print(np.__version__)

1.1.5
1.19.5

2. Consider the following Python dictionary data and Python list labels:

a) Create a DataFrame df from this dictionary data which has the index labels.

In [16]:

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
df = pd.DataFrame(data=data, columns=data.keys())
print(df)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

b) Display a summary of the basic information about this DataFrame and its data

In [17]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

c) Return the first 3 rows of the DataFrame df.

In [18]:
df.head(3)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

d) Select just the 'animal' and 'age' columns from the DataFrame df.

In [25]:
new_df = df[['animal', 'age']]
print(new_df)

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

e) Select the data in rows [3, 4, 8] and in columns ['animal', 'age']

In [31]:
new_df = df.iloc[[3,4,8],[0,1]]
print(new_df)

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

f) Select only the rows where the number of visits is greater than 3.

In [38]:
new_df = df[df['visits']> 2]
print(new_df)

  animal  age  visits priority
1    cat  3.0       3      yes
3    dog  NaN       3      yes
5    cat  2.0       3       no

g) Select the rows where the age is missing, i.e. is NaN.

In [45]:
new_df = df[df['age'].isnull()]
print(new_df)

  animal  age  visits priority
3    dog  NaN       3      yes
7    cat  NaN       1      yes

h) Select the rows the age is between 2 and 4 (inclusive).

In [51]:
new_df = df[(df['age']>=2) & (df['age']<=4)]
print(new_df)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
5    cat  2.0       3       no
9    dog  3.0       1       no

i) Calculate the sum of all visits (the total number of visits).

In [54]:
sum = df['visits'].sum()
print(sum)

19

j) Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [75]:
df1 = pd.DataFrame([['horse',4.5,2,'no'], ['monkey',4.5,2,'yes']], columns = list(df.columns))
new_df = df.append(df1, ignore_index=True)
print(new_df)
new_df = new_df.drop([10, 11])
new_df

    animal  age  visits priority
0      cat  2.5       1      yes
1      cat  3.0       3      yes
2    snake  0.5       2       no
3      dog  NaN       3      yes
4      dog  5.0       2       no
5      cat  2.0       3       no
6    snake  4.5       1       no
7      cat  NaN       1      yes
8      dog  7.0       2       no
9      dog  3.0       1       no
10   horse  4.5       2       no
11  monkey  4.5       2      yes

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

k) The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be Trueand 'no' should be False.

In [93]:
df["priority"].replace({"yes": 1, "no": 0}, inplace=True)
print(df)

  animal  age  visits priority
0    cat  2.5       1        1
1    cat  3.0       3        1
2  snake  0.5       2        0
3    dog  NaN       3        1
4    dog  5.0       2        0
5    cat  2.0       3        0
6  snake  4.5       1        0
7    cat  NaN       1        1
8    dog  7.0       2        0
9    dog  3.0       1        0

3. You have a DataFrame df with a column 'A' of integers. For example:

How do you subtract the row mean from each element in the row?

In [111]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df['mean'] = float(df.mean(axis=0))
df['Sub-mean'] = df['mean'] - df['A']
df

    A      mean  Sub-mean
0   1  4.272727  3.272727
1   2  4.272727  2.272727
2   2  4.272727  2.272727
3   3  4.272727  1.272727
4   4  4.272727  0.272727
5   5  4.272727 -0.727273
6   5  4.272727 -0.727273
7   5  4.272727 -0.727273
8   6  4.272727 -1.727273
9   7  4.272727 -2.727273
10  7  4.272727 -2.727273

4. a) Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series s.

b) Find the sum of the values in s for every Wednesday.

c) For each calendar month in s, find the mean of values.

d) Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

5. a) Some values in the Flight Number column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column

In [118]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df
list_new = list(np.arange(10045,10095,10))
df["FlightNumber"] = list_new

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

b) The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary Data Frame with the correct values. Assign the correct column names to this temporary Data Frame.

In [125]:
df['From'], df['To'] = df['From_To'].str.split('_',1).str
temp_df = df[['From', 'To', 'FlightNumber','RecentDelays','Airline']]
temp_df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  """Entry point for launching an IPython kernel.

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

c) n the Airline column, you can see some extra punctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. '(British Airways. )' should become 'British Airways'.

In [129]:
df['Airline'] = df['Airline'].str.replace('\W', '')
df = df[['From', 'To', 'FlightNumber', 'RecentDelays', 'Airline']]
df

       From         To  FlightNumber  RecentDelays         Airline
0    LoNDon      paris         10045      [23, 47]             KLM
1    MAdrid      miLAN         10055            []     AirFrance12
2    londON  StockhOlm         10065  [24, 43, 87]  BritishAirways
3  Budapest      PaRis         10075          [13]     12AirFrance
4  Brussels     londOn         10085      [67, 32]        SwissAir

6. Given the lists letters = ['A', 'B', 'C'] and numbers = list(range(10)), construct a Multi Index object from the product of the two lists. Use it to index a Series of random numbers. Call this Series s.

7. Create a pandas series from: a list, numpy and a dictionary

In [160]:
list1 = list(np.arange(10))
s1 = pd.Series(list1)#'''index=("a","b","c","d","e","f","g","h","i","j"),''')
print(s1)
s
a = np.arange(15)
s2 = pd.Series(a, name='marks')

b = {'London':10,'Delhi':11,'Dubai':15}
s3 = pd.Series(b)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

8. How to combine many series to form a data frame?

In [173]:
s1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'], name='s1')

s2 = pd.Series([3, 4], index=['A', 'B'], name='s2')

pd.concat([s1, s2], axis=0)

A    1
B    2
C    3
A    3
B    4
dtype: int64

9. How to get the items of series A not present in series B?

In [174]:
s_r = pd.Series(list(set(s1).intersection(set(s2))))
print(s_r)

0    3
dtype: int64

10. How to get the items not common to both series A and series B?

In [182]:
ser1 = pd.Series([1, 2, 3, 4, 5]) 
ser2 = pd.Series([3, 4, 5, 6, 7]) 
 
union = pd.Series(np.union1d(ser1, ser2)) 
  
 
intersect = pd.Series(np.intersect1d(ser1, ser2)) 
  
 
notcommonseries = pd.Series(union[~union.isin(intersect)] )

0    1
1    2
5    6
6    7
dtype: int64

11. How to get frequency counts of unique items of a series?

In [188]:
ser2.value_counts()

7    1
6    1
5    1
4    1
3    1
dtype: int64

14. How to convert the first character of each element in a series to uppercase?

In [208]:
s1 = pd.Series(["Rahul","sneha","wastika"])
for i in range(len(s1)):
  s1[i] = s1[i].capitalize()
s1

0      Rahul
1      Sneha
2    Wastika
dtype: object

16. Replace both values in both diagonals of df with 0.

In [226]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))

if(df.shape[0==df.shape[1]]):
  for i in range(df.shape[0]):
    df[i][i] = 0
else:
  print("does not have a proper diagonal")

17. Create the 3 Data Frames based on the following raw data

In [228]:
raw_data_1 = {'subject_id': ['1', '2', '3', '4', '5'],
'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
raw_data_2 = {
'subject_id': ['4', '5', '6', '7', '8'],
'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
raw_data_3 = {
'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

a) Join the two data frames along rows and assign all_data

In [238]:
raw_data1 = pd.DataFrame(raw_data_1)
raw_data2 = pd.DataFrame(raw_data_2)
raw_data3 = pd.DataFrame(raw_data_3)

new_df = pd.concat([raw_data1, raw_data2], axis=0).reset_index()

   index subject_id first_name last_name
0      0          1       Alex  Anderson
1      1          2        Amy  Ackerman
2      2          3      Allen       Ali
3      3          4      Alice      Aoni
4      4          5     Ayoung   Atiches
5      0          4      Billy    Bonder
6      1          5      Brian     Black
7      2          6       Bran   Balwner
8      3          7      Bryce     Brice
9      4          8      Betty    Btisan

b) Join the two data frames along columns and assing to all_data_col

c) Merge all data and data3 along the subject_id value

e) Merge all values in data1 and data2, with matching records from both sides where available

In [249]:
all_data_col = pd.merge(new_df, raw_data3, on='subject_id', how='outer')

    index subject_id first_name last_name  test_id
0     0.0          1       Alex  Anderson     51.0
1     1.0          2        Amy  Ackerman     15.0
2     2.0          3      Allen       Ali     15.0
3     3.0          4      Alice      Aoni     61.0
4     0.0          4      Billy    Bonder     61.0
5     4.0          5     Ayoung   Atiches     16.0
6     1.0          5      Brian     Black     16.0
7     2.0          6       Bran   Balwner      NaN
8     3.0          7      Bryce     Brice     14.0
9     4.0          8      Betty    Btisan     15.0
10    NaN          9        NaN       NaN      1.0
11    NaN         10        NaN       NaN     61.0
12    NaN         11        NaN       NaN     16.0

d) Merge only the data that has the same 'subject_id' on both data1 and data2

In [251]:
all_data_col2 = pd.merge(new_df, raw_data3, on='subject_id', how='left')
all_data_col2

   index subject_id first_name last_name  test_id
0      0          1       Alex  Anderson     51.0
1      1          2        Amy  Ackerman     15.0
2      2          3      Allen       Ali     15.0
3      3          4      Alice      Aoni     61.0
4      4          5     Ayoung   Atiches     16.0
5      0          4      Billy    Bonder     61.0
6      1          5      Brian     Black     16.0
7      2          6       Bran   Balwner      NaN
8      3          7      Bryce     Brice     14.0
9      4          8      Betty    Btisan     15.0